Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
unified_lstm (UnifiedLSTM)   (None, LAG-1, 30)             3840      
_________________________________________________________________
dropout (Dropout)            (None, LAG-1, 30)             0         
_________________________________________________________________
unified_lstm_1 (UnifiedLSTM) (None, 30)                    7320      
_________________________________________________________________
dense (Dense)                (None, 1)                     31        
=================================================================
Total params: 11,191
Trainable params: 11,191
Non-trainable params: 0
_________________________________________________________________
None
